htibosch/Lab-Project-FreeRTOS-FAT/portable/STM32F7xx_slot.1/ff_sddisk.c
    if( ( pxDisk != NULL ) && ( pxDisk->xStatus.bIsInitialised != pdFALSE ) )
    {
        pxReturn = pxDisk->pxIOManager;
    }
    else
    {
        pxReturn = NULL;
    }

    return pxReturn;
}
/*-----------------------------------------------------------*/

/* Release all resources */
BaseType_t FF_SDDiskDelete( FF_Disk_t * pxDisk )
{
    if( pxDisk != NULL )
    {
        pxDisk->ulSignature = 0;
        pxDisk->xStatus.bIsInitialised = 0;

        if( pxDisk->pxIOManager != NULL )
        {
            if( FF_Mounted( pxDisk->pxIOManager ) != pdFALSE )
            {
                FF_Unmount( pxDisk );
            }

            FF_DeleteIOManager( pxDisk->pxIOManager );
        }

        vPortFree( pxDisk );
    }

    return 1;
}
/*-----------------------------------------------------------*/

BaseType_t FF_SDDiskShowPartition( FF_Disk_t * pxDisk )
{
    FF_Error_t xError;
    uint64_t ullFreeSectors;
    uint32_t ulTotalSizeMB, ulFreeSizeMB;
    int iPercentageFree;
    FF_IOManager_t * pxIOManager;
    const char * pcTypeName = "unknown type";
    BaseType_t xReturn = pdPASS;

    if( pxDisk == NULL )
    {
        xReturn = pdFAIL;
    }
    else
    {
        pxIOManager = pxDisk->pxIOManager;

        FF_PRINTF( "Reading FAT and calculating Free Space\n" );

        switch( pxIOManager->xPartition.ucType )
        {
            case FF_T_FAT12:
                pcTypeName = "FAT12";
                break;

            case FF_T_FAT16:
                pcTypeName = "FAT16";
                break;

            case FF_T_FAT32:
                pcTypeName = "FAT32";
                break;

            default:
                pcTypeName = "UNKOWN";
                break;
        }

        FF_GetFreeSize( pxIOManager, &xError );

        ullFreeSectors = pxIOManager->xPartition.ulFreeClusterCount * pxIOManager->xPartition.ulSectorsPerCluster;
        iPercentageFree = ( int ) ( ( sdHUNDRED_64_BIT * ullFreeSectors + pxIOManager->xPartition.ulDataSectors / 2 ) /
                                    ( ( uint64_t ) pxIOManager->xPartition.ulDataSectors ) );

        ulTotalSizeMB = pxIOManager->xPartition.ulDataSectors / sdSECTORS_PER_MB;
        ulFreeSizeMB = ( uint32_t ) ( ullFreeSectors / sdSECTORS_PER_MB );

        /* It is better not to use the 64-bit format such as %Lu because it
         * might not be implemented. */
        FF_PRINTF( "Partition Nr   %8u\n", pxDisk->xStatus.bPartitionNumber );
        FF_PRINTF( "Type           %8u (%s)\n", pxIOManager->xPartition.ucType, pcTypeName );
        FF_PRINTF( "VolLabel       '%8s' \n", pxIOManager->xPartition.pcVolumeLabel );
        FF_PRINTF( "TotalSectors   %8u\n", ( unsigned ) pxIOManager->xPartition.ulTotalSectors );
        FF_PRINTF( "SecsPerCluster %8u\n", ( unsigned ) pxIOManager->xPartition.ulSectorsPerCluster );
        FF_PRINTF( "Size           %8u MB\n", ( unsigned ) ulTotalSizeMB );
        FF_PRINTF( "FreeSize       %8u MB ( %d percent free )\n", ( unsigned ) ulFreeSizeMB, iPercentageFree );
    }

    return xReturn;
}
/*-----------------------------------------------------------*/

/* SDIO init function */
static void prvSDIO_SD_Init( void )
{
    xSDHandle.Instance = SDIO_Instance;
    xSDHandle.Init.ClockEdge = SDIO_CLOCK_EDGE_RISING;
    xSDHandle.Init.ClockBypass = SDIO_CLOCK_BYPASS_DISABLE;
    xSDHandle.Init.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_DISABLE;

    /* Start as a 1-bit bus and switch to 4-bits later on. */
    xSDHandle.Init.BusWide = SDIO_BUS_WIDE_1B;

    xSDHandle.Init.HardwareFlowControl = SDIO_HARDWARE_FLOW_CONTROL_DISABLE;

    /* Use fastest CLOCK at 0. */
    xSDHandle.Init.ClockDiv = 0U;

    #if ( SDIO_USES_DMA != 0 )
    {
        xSDHandle.EventSetupFunction = prvEventSetupFunction;
        xSDHandle.EventWaitFunction = prvEventWaitFunction;
    }
    #else
    {
        xSDHandle.EventSetupFunction = NULL;
        xSDHandle.EventWaitFunction = NULL;
    }
    #endif
    __HAL_RCC_SDIO_CLK_ENABLE();
}
/*-----------------------------------------------------------*/

/* This routine returns true if the SD-card is inserted.  After insertion, it
 * will wait for sdCARD_DETECT_DEBOUNCE_TIME_MS before returning pdTRUE. */
BaseType_t FF_SDDiskDetect( FF_Disk_t * pxDisk )
{
    int xReturn;

    xReturn = prvSDDetect();

    if( xReturn != pdFALSE )
    {
        if( xCardDetect.bStableSignal == pdFALSE )
        {
            /* The card seems to be present. */
            if( xCardDetect.bLastPresent == pdFALSE )
            {
                xCardDetect.bLastPresent = pdTRUE;
                xCardDetect.xRemainingTime = pdMS_TO_TICKS( ( TickType_t ) sdCARD_DETECT_DEBOUNCE_TIME_MS );
                /* Fetch the current time. */
                vTaskSetTimeOutState( &xCardDetect.xTimeOut );
            }

            /* Has the timeout been reached? */
            if( xTaskCheckForTimeOut( &xCardDetect.xTimeOut, &xCardDetect.xRemainingTime ) != pdFALSE )
            {
                xCardDetect.bStableSignal = pdTRUE;
            }
            else
            {
                /* keep returning false until de time-out is reached. */
                xReturn = pdFALSE;
            }
        }
    }
    else
    {
        xCardDetect.bLastPresent = pdFALSE;
        xCardDetect.bStableSignal = pdFALSE;
    }

    return xReturn;
}
/*-----------------------------------------------------------*/

/* Raw SD-card detection, just return the GPIO status. */
static BaseType_t prvSDDetect( void )
{
    int iReturn;

    /*!< Check GPIO to detect SD */
    if( HAL_GPIO_ReadPin( configSD_DETECT_GPIO_PORT, configSD_DETECT_PIN ) != 0 )
    {
        /* The internal pull-up makes the signal high. */
        iReturn = pdFALSE;
    }
    else
    {
        /* The card will pull the GPIO signal down. */
        iReturn = pdTRUE;
    }

    return iReturn;
}
/*-----------------------------------------------------------*/

static BaseType_t prvSDMMCInit( BaseType_t xDriveNumber )
{
    /* 'xDriveNumber' not yet in use. */
    ( void ) xDriveNumber;

    if( xSDCardSemaphore == NULL )
    {
        xSDCardSemaphore = xSemaphoreCreateBinary();
    }

	/* Set xSDHandle with ClockDiv and event handlers. */
    prvSDIO_SD_Init();

	/* Assignment of GPIO pins. */
    vGPIO_SD_Init( &xSDHandle );

    #if ( SDIO_USES_DMA != 0 )
    {
		/* Initialisation of SDMMC and DMA. */
        prvSDIO_DMA_Init();
    }
    #endif

    int SD_state = SD_OK;

    /* Check if the SD card is plugged in the slot */
    if( prvSDDetect() == pdFALSE )
    {
        FF_PRINTF( "No SD card detected\n" );
        return pdFAIL;
    }

