htibosch/Lab-Project-FreeRTOS-FAT/portable/STM32F7xx_slot.1/ff_sddisk.c
    /* When starting up, skip debouncing of the Card Detect signal. */
    xCardDetect.bLastPresent = pdTRUE;
    xCardDetect.bStableSignal = pdTRUE;
	/* Initialise the SDIO device and read the card parameters.
	 * Note that HAL_SD_Init() will call HAL_SD_MspInit() */
    SD_state = HAL_SD_Init( &xSDHandle, &xSDCardInfo );
    #if ( BUS_4BITS != 0 )
    {
        if( SD_state == SD_OK )
        {
            HAL_SD_ErrorTypedef rc;

            xSDHandle.Init.BusWide = SDIO_BUS_WIDE_4B;
            rc = HAL_SD_WideBusOperation_Config( &xSDHandle, SDIO_BUS_WIDE_4B );

            if( rc != SD_OK )
            {
                FF_PRINTF( "HAL_SD_WideBus: %d: %s\n", rc, prvSDCodePrintable( ( uint32_t ) rc ) );
            }
        }
    }
    #endif /* if ( BUS_4BITS != 0 ) */
    FF_PRINTF( "HAL_SD_Init: %d: %s type: %s Capacity: %u MB\n",
               SD_state, prvSDCodePrintable( ( uint32_t ) SD_state ),
               xSDHandle.CardType == HIGH_CAPACITY_SD_CARD ? "SDHC" : "SD",
			   ( unsigned ) ( xSDCardInfo.CardCapacity / ( 1024U * 1024U ) ) );

    return ( SD_state == SD_OK ) ? pdPASS : pdFAIL;
}
/*-----------------------------------------------------------*/

struct xCODE_NAME
{
    uint32_t ulValue;
    const char * pcName;
};

const struct xCODE_NAME xSD_CODES[] =
{
	{ /* 01 */ SD_CMD_CRC_FAIL,          "CMD_CRC_FAIL: Command response received (but CRC check failed)"                                                                         },
	{ /* 02 */ SD_DATA_CRC_FAIL,         "DATA_CRC_FAIL: Data block sent/received (CRC check failed)"                                                                             },
	{ /* 03 */ SD_CMD_RSP_TIMEOUT,       "CMD_RSP_TIMEOUT: Command response timeout"                                                                                              },
	{ /* 04 */ SD_DATA_TIMEOUT,          "DATA_TIMEOUT: Data timeout"                                                                                                             },
	{ /* 05 */ SD_TX_UNDERRUN,           "TX_UNDERRUN: Transmit FIFO underrun"                                                                                                    },
	{ /* 06 */ SD_RX_OVERRUN,            "RX_OVERRUN: Receive FIFO overrun"                                                                                                       },
	{ /* 07 */ SD_START_BIT_ERR,         "START_BIT_ERR: Start bit not detected on all data signals in wide bus mode"                                                             },
	{ /* 08 */ SD_CMD_OUT_OF_RANGE,      "CMD_OUT_OF_RANGE: Command's argument was out of range"                                                                                  },
	{ /* 09 */ SD_ADDR_MISALIGNED,       "ADDR_MISALIGNED: Misaligned address"                                                                                                    },
	{ /* 10 */ SD_BLOCK_LEN_ERR,         "BLOCK_LEN_ERR: Transferred block length is not allowed for the card or the number of transferred bytes does not match the block length" },
	{ /* 11 */ SD_ERASE_SEQ_ERR,         "ERASE_SEQ_ERR: An error in the sequence of erase command occurs."                                                                       },
	{ /* 12 */ SD_BAD_ERASE_PARAM,       "BAD_ERASE_PARAM: An invalid selection for erase groups"                                                                                 },
	{ /* 13 */ SD_WRITE_PROT_VIOLATION,  "WRITE_PROT_VIOLATION: Attempt to program a write protect block"                                                                         },
	{ /* 14 */ SD_LOCK_UNLOCK_FAILED,    "LOCK_UNLOCK_FAILED: Sequence or password error has been detected in unlock command or if there was an attempt to access a locked card"  },
	{ /* 15 */ SD_COM_CRC_FAILED,        "COM_CRC_FAILED: CRC check of the previous command failed"                                                                               },
	{ /* 16 */ SD_ILLEGAL_CMD,           "ILLEGAL_CMD: Command is not legal for the card state"                                                                                   },
	{ /* 17 */ SD_CARD_ECC_FAILED,       "CARD_ECC_FAILED: Card internal ECC was applied but failed to correct the data"                                                          },
	{ /* 18 */ SD_CC_ERROR,              "CC_ERROR: Internal card controller error"                                                                                               },
	{ /* 19 */ SD_GENERAL_UNKNOWN_ERROR, "GENERAL_UNKNOWN_ERROR: General or unknown error"                                                                                        },
	{ /* 20 */ SD_STREAM_READ_UNDERRUN,  "STREAM_READ_UNDERRUN: The card could not sustain data transfer in stream read operation"                                                },
	{ /* 21 */ SD_STREAM_WRITE_OVERRUN,  "STREAM_WRITE_OVERRUN: The card could not sustain data programming in stream mode"                                                       },
	{ /* 22 */ SD_CID_CSD_OVERWRITE,     "CID_CSD_OVERWRITE: CID/CSD overwrite error"                                                                                             },
	{ /* 23 */ SD_WP_ERASE_SKIP,         "WP_ERASE_SKIP: Only partial address space was erased"                                                                                   },
	{ /* 24 */ SD_CARD_ECC_DISABLED,     "CARD_ECC_DISABLED: Command has been executed without using internal ECC"                                                                },
	{ /* 25 */ SD_ERASE_RESET,           "ERASE_RESET: Erase sequence was cleared before executing because an out of erase sequence command was received"                         },
	{ /* 26 */ SD_AKE_SEQ_ERROR,         "AKE_SEQ_ERROR: Error in sequence of authentication"                                                                                     },
	{ /* 27 */ SD_INVALID_VOLTRANGE,     "INVALID_VOLTRANGE"                                                                                                                      },
	{ /* 28 */ SD_ADDR_OUT_OF_RANGE,     "ADDR_OUT_OF_RANGE"                                                                                                                      },
	{ /* 29 */ SD_SWITCH_ERROR,          "SWITCH_ERROR"                                                                                                                           },
	{ /* 30 */ SD_SDIO_DISABLED,         "SDIO_DISABLED"                                                                                                                          },
	{ /* 31 */ SD_SDIO_FUNCTION_BUSY,    "SDIO_FUNCTION_BUSY"                                                                                                                     },
	{ /* 32 */ SD_SDIO_FUNCTION_FAILED,  "SDIO_FUNCTION_FAILED"                                                                                                                   },
	{ /* 33 */ SD_SDIO_UNKNOWN_FUNCTION, "SDIO_UNKNOWN_FUNCTION"                                                                                                                  },

    /**
     * @brief  Standard error defines
     */
    { SD_INTERNAL_ERROR,         "INTERNAL_ERROR"                                                                                                                         },
    { SD_NOT_CONFIGURED,         "NOT_CONFIGURED"                                                                                                                         },
    { SD_REQUEST_PENDING,        "REQUEST_PENDING"                                                                                                                        },
    { SD_REQUEST_NOT_APPLICABLE, "REQUEST_NOT_APPLICABLE"                                                                                                                 },
    { SD_INVALID_PARAMETER,      "INVALID_PARAMETER"                                                                                                                      },
    { SD_UNSUPPORTED_FEATURE,    "UNSUPPORTED_FEATURE"                                                                                                                    },
    { SD_UNSUPPORTED_HW,         "UNSUPPORTED_HW"                                                                                                                         },
    { SD_ERROR,                  "ERROR"                                                                                                                                  },
    { SD_OK,                     "OK"                                                                                                                                     },
};
/*-----------------------------------------------------------*/

